# SystemsAnalysisOptions Properties

---
The SystemsAnalysisOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OutputFolder|  The path of the output folder for systems analysis.
| WeatherFile|  The file name of the EnergyPlus weather (*.epw).
| WorkflowFile|  The file name of the EnergyPlus workflow script.
Top
#### Reference
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace